Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D29.svd
            <register>
               <name>NCFGR</name>
               <description>Network Configuration Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00080000</resetValue>
               <fields>
                  <field>
                     <name>SPD</name>
                     <description>Speed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FD</name>
                     <description>Full Duplex</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DNVLAN</name>
                     <description>Discard Non-VLAN FRAMES</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JFRAME</name>
                     <description>Jumbo Frame Size</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAF</name>
                     <description>Copy All Frames</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBC</name>
                     <description>No Broadcast</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MTIHEN</name>
                     <description>Multicast Hash Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNIHEN</name>
                     <description>Unicast Hash Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MAXFS</name>
                     <description>1536 Maximum Frame Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTY</name>
                     <description>Retry Test0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEN</name>
                     <description>Pause Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFO</name>
                     <description>Receive Buffer Offset</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LFERD</name>
                     <description>Length Field Error Frame Discard</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFCS</name>
                     <description>Remove FCS</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLK</name>
                     <description>MDC CLock Division</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CLKSelect</name>
                        <enumeratedValue>
                           <name>MCK_8</name>
                           <description>MCK divided by 8 (MCK up to 20 MHz)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_16</name>
                           <description>MCK divided by 16 (MCK up to 40 MHz)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_32</name>
                           <description>MCK divided by 32 (MCK up to 80 MHz)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_48</name>
                           <description>MCK divided by 48 (MCK up to 120 MHz)</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_64</name>
                           <description>MCK divided by 64 (MCK up to 160 MHz)</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_96</name>
                           <description>MCK divided by 96 (MCK up to 240 MHz)</description>
                           <value>5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DCPF</name>
                     <description>Disable Copy of Pause Frames</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCOEN</name>
                     <description>Receive Checksum Offload Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EFRHD</name>
                     <description>Enable Frames Received in Half Duplex</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRXFCS</name>
                     <description>Ignore RX FCS</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IPGSEN</name>
                     <description>IP Stretch Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBP</name>
                     <description>Receive Bad Preamble</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRXER</name>
                     <description>Ignore Receive Error from PHY</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NSR</name>
               <description>Network Status Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MDIO</name>
                     <description>MDIO Input Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDLE</name>
                     <description>PHY Management Logic Idle</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFCPAUSN</name>
                     <description>PFC Pause Negotiated</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXLPIS</name>
                     <description>LPI Indication</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UR</name>
               <description>User Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RMII</name>
                     <description>Reduced MII Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RMIISelect</name>
                        <enumeratedValue>
                           <name>1</name>
                           <description>RMII mode is selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HDFLCTLEN</name>
                     <description>Half Duplex Flow Control Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HDFLCTLENSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Half duplex flow control is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Half duplex flow control is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCFGR</name>
               <description>DMA Configuration Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00020004</resetValue>
               <fields>
                  <field>
                     <name>FBLDO</name>
                     <description>Fixed Burst Length for DMA Data Operations:</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>FBLDOSelect</name>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Always use single access on system bus</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <description>Attempt to use 4-beat bursts on system bus (Default)</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <description>Attempt to use 8-beat bursts on system bus bursts</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <description>Attempt to use 16-beat bursts on system bus bursts</description>
                           <value>16</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ESMA</name>
                     <description>Endian Swap Mode Enable for Management Descriptor Accesses</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ESMASelect</name>
                        <enumeratedValue>
                           <name>LITTLE_ENDIAN</name>
                           <description>Selects Little-endian endianism for system bus transfers.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIG_ENDIAN</name>
                           <description>Selects swapped endianism for system bus transfers.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ESPA</name>
                     <description>Endian Swap Mode Enable for Packet Data Accesses</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ESPASelect</name>
                        <enumeratedValue>
                           <name>LITTLE_ENDIAN</name>
                           <description>Selects Little-endian endianism for system bus transfers.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BIG_ENDIAN</name>
                           <description>Selects swapped endianism for system bus transfers.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXBMS</name>
                     <description>Receiver Packet Buffer Memory Size Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RXBMSSelect</name>
                        <enumeratedValue>
                           <name>EIGHTH</name>
                           <description>4/8 Kbyte Memory Size</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QUARTER</name>
                           <description>4/4 Kbytes Memory Size</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HALF</name>
                           <description>4/2 Kbytes Memory Size</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FULL</name>
                           <description>4 Kbytes Memory Size</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXPBMS</name>
                     <description>Transmitter Packet Buffer Memory Size Select</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TXPBMSSelect</name>
                        <enumeratedValue>
                           <name>TWO_KB</name>
                           <description>Do not use top address bit (2 Kbytes).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR_KB</name>
                           <description>Use full configured addressable space (4 Kbytes).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXCOEN</name>
                     <description>Transmitter Checksum Generation Offload Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INFLASTEN</name>
                     <description>Infinite Size for Last Buffer Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCERRREP</name>
                     <description>CRC Errors Report</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCERRREPSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Bit 16 of the receive buffer descriptor represents the Canonical format indicator (CFI) bit as extracted from the receive frame (if the receive buffer descriptor is pointing to the last data buffer of the receive frame and the received frame was VLAN tagged).</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Bit 16 of the receive buffer descriptor represents the FCS/CRC error (only if frames with FCS are copied to memory as enabled by bit 26 in the Network Configuration register).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DRBS</name>
                     <description>DMA Receive Buffer Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>DRBSSelect</name>
                        <enumeratedValue>
                           <name>0x02</name>
                           <description>128 bytes</description>
                           <value>0x02</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0x18</name>
                           <description>1536 bytes (1 x max length frame/buffer)</description>
                           <value>0x18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0xA0</name>
                           <description>10240 bytes (1 x 10K jumbo frame/buffer)</description>
                           <value>0xA0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DDRP</name>
                     <description>DMA Discard Receive Packets</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFOMAXB</name>
                     <description>Force Receive Max Burst Length</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFOMAXB</name>
                     <description>Force Transmit Max Burst Length</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBD_EXTENDED</name>
                     <description>Receive Buffer Descriptor Extended Mode</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RXBD_EXTENDEDSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disables Receive Buffer Data Extended mode.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enables Receive Buffer Data Extended mode.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXBD_EXTENDED</name>
                     <description>Transmit Buffer Descriptor Extended Mode</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TXBD_EXTENDEDSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disables Transmit Buffer Data Extended mode.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enables Transmit Buffer Data Extended mode.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
