Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D29.svd
               <register>
                  <name>SAT</name>
                  <description>Specific Address 1 Top Register</description>
                  <addressOffset>0x04</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Specific Address 2</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>FILTSORD</name>
                        <description>Filter Source or Destination MAC Address</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>FILTSORDSelect</name>
                           <enumeratedValue>
                              <name>0</name>
                              <description>The filter is a destination address filter.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>The filter is a source address filter.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>FILTBMASK</name>
                        <description>Filter Bytes Mask</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                        <enumeratedValues>
                           <name>FILTBMASKSelect</name>
                           <enumeratedValue>
                              <name>BIT1</name>
                              <description>Controls whether the first byte has been received.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT2</name>
                              <description>Controls whether the second byte has been received.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT3</name>
                              <description>Controls whether the third byte has been received.</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT4</name>
                              <description>Controls whether the fourth byte has been received.</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT5</name>
                              <description>Controls whether the fifth byte has been received.</description>
                              <value>0x10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BIT6</name>
                              <description>Controls whether the sixth byte has been received</description>
                              <value>0x20</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>TIDM1</name>
               <description>Type ID Match 1 Register</description>
               <addressOffset>0xA8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID1</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENID1Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>TID is not part of the comparison match.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TID is processed for the comparison match.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIDM2</name>
               <description>Type ID Match 2 Register</description>
               <addressOffset>0xAC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID2</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENID2Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>TID is not part of the comparison match.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TID is processed for the comparison match.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIDM3</name>
               <description>Type ID Match 3 Register</description>
               <addressOffset>0xB0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID3</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENID3Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>TID is not part of the comparison match.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TID is processed for the comparison match.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIDM4</name>
               <description>Type ID Match 4 Register</description>
               <addressOffset>0xB4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TID</name>
                     <description>Type ID Match 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ENID4</name>
                     <description>Enable Copying of TID Matched Frames</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENID4Select</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>TID is not part of the comparison match.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TID is processed for the comparison match.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WOL</name>
               <description>Wake on LAN Register</description>
               <addressOffset>0xB8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IP</name>
                     <description>ARP Request IP Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MAG</name>
                     <description>Magic Packet Event Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARP</name>
                     <description>ARP Request Event Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SA1</name>
                     <description>Specific Address Register 1 Event Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MTI</name>
                     <description>Multicast Hash Event Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPGS</name>
               <description>IPG Stretch Register</description>
               <addressOffset>0xBC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FL</name>
                     <description>Frame Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SVLAN</name>
               <description>Stacked VLAN Register</description>
               <addressOffset>0xC0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VLAN_TYPE</name>
                     <description>User Defined VLAN_TYPE Field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ESVLAN</name>
                     <description>Enable Stacked VLAN Processing Mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ESVLANSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable the stacked VLAN Processing mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable the stacked VLAN Processing mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPFCP</name>
               <description>Transmit PFC Pause Register</description>
               <addressOffset>0xC4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PEV</name>
                     <description>Priority Enable Vector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PQ</name>
                     <description>Pause Quantum</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAMB1</name>
               <description>Specific Address 1 Mask Bottom Register</description>
               <addressOffset>0xC8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Specific Address 1 Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SAMT1</name>
               <description>Specific Address 1 Mask Top Register</description>
               <addressOffset>0xCC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Specific Address 1 Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AMRX</name>
               <description>System Memory Address Mask for RX Data Buffer Accesses Register</description>
               <addressOffset>0xD0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MSBADDRMSK</name>
                     <description>Mask of the Receive Data Buffer Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MSBADDR</name>
                     <description>MSB of the Receive Data Buffer Address</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXUDAR</name>
               <description>PTP RX Unicast IP Destination Address Register</description>
               <addressOffset>0xD4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXUDA</name>
                     <description>Receive Unicast Destination Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXUDAR</name>
               <description>PTP TX Unicast IP Destination Address Register</description>
               <addressOffset>0xD8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXUDA</name>
                     <description>Transmit Unicast Destination Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NSC</name>
               <description>1588 Timer Nanosecond Comparison Register</description>
               <addressOffset>0xDC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NANOSEC</name>
                     <description>1588 Timer Nanosecond Comparison Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCL</name>
               <description>1588 Timer Second Comparison Low Register</description>
               <addressOffset>0xE0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>1588 Timer Second Comparison Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCH</name>
               <description>1588 Timer Second Comparison High Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>1588 Timer Second Comparison Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFTSH</name>
               <description>PTP Event Frame Transmitted Seconds High Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFRSH</name>
               <description>PTP Event Frame Received Seconds High Register</description>
               <addressOffset>0xEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFTSH</name>
               <description>PTP Peer Event Frame Transmitted Seconds High Register</description>
               <addressOffset>0xF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFRSH</name>
               <description>PTP Peer Event Frame Received Seconds High Register</description>
               <addressOffset>0xF4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTLO</name>
               <description>Octets Transmitted Low Register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXO</name>
                     <description>Transmitted Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTHI</name>
               <description>Octets Transmitted High Register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXO</name>
                     <description>Transmitted Octets</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
