Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D29.svd
            <register>
               <name>CBSCR</name>
               <description>Credit-Based Shaping Control Register</description>
               <addressOffset>0x4BC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QAE</name>
                     <description>Queue A CBS Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>QAESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Credit-based shaping on the second highest priority queue (queue A) is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Credit-based shaping on the second highest priority queue (queue A) is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QBE</name>
                     <description>Queue B CBS Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>QBESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Credit-based shaping on the highest priority queue (queue B) is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Credit-based shaping on the highest priority queue (queue B) is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CBSISQA</name>
               <description>Credit-Based Shaping IdleSlope Register for Queue A</description>
               <addressOffset>0x4C0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IS</name>
                     <description>IdleSlope</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CBSISQB</name>
               <description>Credit-Based Shaping IdleSlope Register for Queue B</description>
               <addressOffset>0x4C4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IS</name>
                     <description>IdleSlope</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TQUBA</name>
               <description>32 MSB Transmit Buffer Descriptor Queue Base Address Register</description>
               <addressOffset>0x4C8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TQUBA</name>
                     <description>Transmit Queue Upper Buffer Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBDCTRL</name>
               <description>Transmit Buffer Data Control Register</description>
               <addressOffset>0x4CC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSMODE</name>
                     <description>Transmit Descriptor Timestamp Insertion Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TSMODESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Timestamp insertion disable.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTPEVENT</name>
                           <description>Timestamp inserted for PTP Event Frames only.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTPALL</name>
                           <description>Timestamp inserted for All PTP Frames only.</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALL</name>
                           <description>Timestamp inserted for All Frames.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXBDCTRL</name>
               <description>Receive Buffer Data Control Register</description>
               <addressOffset>0x4D0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TSMODE</name>
                     <description>Receive Descriptor Timestamp Insertion Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TSMODESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Timestamp insertion disable.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTPEVENT</name>
                           <description>Timestamp inserted for PTP Event Frames only.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTPALL</name>
                           <description>Timestamp inserted for All PTP Frames only.</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALL</name>
                           <description>Timestamp inserted for All Frames.</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RQUBA</name>
               <description>32 MSB Receive Buffer Descriptor Queue Base Address Register</description>
               <addressOffset>0x4D4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RQUBA</name>
                     <description>Receive Queue Upper Buffer Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST1RPQ</name>
               <description>Screening Type 1 Register Priority Queue (index = 0)</description>
               <addressOffset>0x500</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QNB</name>
                     <description>Queue Number (0-2)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DSTCM</name>
                     <description>Differentiated Services or Traffic Class Match</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>UDPM</name>
                     <description>UDP Port Match</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DSTCE</name>
                     <description>Differentiated Services or Traffic Class Match Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDPE</name>
                     <description>UDP Port Match Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2RPQ</name>
               <description>Screening Type 2 Register Priority Queue (index = 0)</description>
               <addressOffset>0x540</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QNB</name>
                     <description>Queue Number (0-2)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>VLANP</name>
                     <description>VLAN Priority</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>VLANE</name>
                     <description>VLAN Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VLANESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>VLAN match is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>VLAN match is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>I2ETH</name>
                     <description>Index of Screening Type 2 EtherType register</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>ETHE</name>
                     <description>EtherType Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ETHESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>EtherType match with bits 15:0 in the register designated by the value of I2ETH is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>EtherType match with bits 15:0 in the register designated by the value of I2ETH is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COMPA</name>
                     <description>Index of Screening Type 2 Compare Word 0/Word 1 register</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>COMPAE</name>
                     <description>Compare A Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>COMPAESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Comparison via the register designated by index COMPA is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Comparison via the register designated by index COMPA is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COMPB</name>
                     <description>Index of Screening Type 2 Compare Word 0/Word 1 register</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>COMPBE</name>
                     <description>Compare B Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>COMPBESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Comparison via the register designated by index COMPB is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Comparison via the register designated by index COMPB is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COMPC</name>
                     <description>Index of Screening Type 2 Compare Word 0/Word 1 register</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>COMPCE</name>
                     <description>Compare C Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>COMPCESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Comparison via the register designated by index COMPC is disabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Comparison via the register designated by index COMPC is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
