Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D29.svd
            <register>
               <name>TSCTL</name>
               <description>Transmit Schedule Control Register</description>
               <addressOffset>0x580</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXSQ0</name>
                     <description>Transmit Schedule for Qx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXSQ0Select</name>
                        <enumeratedValue>
                           <name>FP</name>
                           <description>Fixed Priority</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBS</name>
                           <description>CBS Enabled only valid for top two enabled queues and if CBS capability selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DWRR</name>
                           <description>DWRR enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETS</name>
                           <description>ETS enabled</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXSQ1</name>
                     <description>Transmit Schedule for Qx</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXSQ1Select</name>
                        <enumeratedValue>
                           <name>FP</name>
                           <description>Fixed Priority</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBS</name>
                           <description>CBS Enabled only valid for top two enabled queues and if CBS capability selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DWRR</name>
                           <description>DWRR enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETS</name>
                           <description>ETS enabled</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXSQ2</name>
                     <description>Transmit Schedule for Qx</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXSQ2Select</name>
                        <enumeratedValue>
                           <name>FP</name>
                           <description>Fixed Priority</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBS</name>
                           <description>CBS Enabled only valid for top two enabled queues and if CBS capability selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DWRR</name>
                           <description>DWRR enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETS</name>
                           <description>ETS enabled</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXSQ3</name>
                     <description>Transmit Schedule for Qx</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXSQ3Select</name>
                        <enumeratedValue>
                           <name>FP</name>
                           <description>Fixed Priority</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBS</name>
                           <description>CBS Enabled only valid for top two enabled queues and if CBS capability selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DWRR</name>
                           <description>DWRR enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETS</name>
                           <description>ETS enabled</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXSQ4</name>
                     <description>Transmit Schedule for Qx</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXSQ4Select</name>
                        <enumeratedValue>
                           <name>FP</name>
                           <description>Fixed Priority</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBS</name>
                           <description>CBS Enabled only valid for top two enabled queues and if CBS capability selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DWRR</name>
                           <description>DWRR enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETS</name>
                           <description>ETS enabled</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXSQ5</name>
                     <description>Transmit Schedule for Qx</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXSQ5Select</name>
                        <enumeratedValue>
                           <name>FP</name>
                           <description>Fixed Priority</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBS</name>
                           <description>CBS Enabled only valid for top two enabled queues and if CBS capability selected.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DWRR</name>
                           <description>DWRR enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ETS</name>
                           <description>ETS enabled</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TQBWRL0</name>
               <description>Transmit Queue Bandwidth Rate Limit 0 Register</description>
               <addressOffset>0x590</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ALLOCQ0</name>
                     <description>DWRR Weighting or ETS Bandwidth Allocation for Qx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ALLOCQ1</name>
                     <description>DWRR Weighting or ETS Bandwidth Allocation for Qx</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ALLOCQ2</name>
                     <description>DWRR Weighting or ETS Bandwidth Allocation for Qx</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ALLOCQ3</name>
                     <description>DWRR Weighting or ETS Bandwidth Allocation for Qx</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TQSA</name>
               <description>Transmit Queue Segment Allocation Register</description>
               <addressOffset>0x5A0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEGALLOCQ0</name>
                     <description>Segment Allocation for Qx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SEGALLOCQ1</name>
                     <description>Segment Allocation for Qx</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SEGALLOCQ2</name>
                     <description>Segment Allocation for Qx</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SEGALLOCQ3</name>
                     <description>Segment Allocation for Qx</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SEGALLOCQ4</name>
                     <description>Segment Allocation for Qx</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SEGALLOCQ5</name>
                     <description>Segment Allocation for Qx</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>IERPQ[%s]</name>
               <description>Interrupt Enable Register Priority Queue (index = 1)</description>
               <addressOffset>0x600</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to System Bus Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>System Bus Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>IDRPQ[%s]</name>
               <description>Interrupt Disable Register Priority Queue (index = 1)</description>
               <addressOffset>0x620</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TFC</name>
                     <description>Transmit Frame Corruption Due to System Bus Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>System Bus Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>IMRPQ[%s]</name>
               <description>Interrupt Mask Register Priority Queue (index = 1)</description>
               <addressOffset>0x640</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RCOMP</name>
                     <description>Receive Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXUBR</name>
                     <description>RX Used Bit Read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RLEX</name>
                     <description>Retry Limit Exceeded or Late Collision</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB</name>
                     <description>Transmit Frame Corruption Due to System Bus Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCOMP</name>
                     <description>Transmit Complete</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRESP</name>
                     <description>System Bus Error</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ST2ER</name>
               <description>Screening Type 2 Ethertype Register (index = 0)</description>
               <addressOffset>0x6E0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMPVAL</name>
                     <description>Ethertype Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>1</dim>
               <dimIncrement>0x08</dimIncrement>
               <name>GMAC_ST2CW[%s]</name>
               <description/>
               <addressOffset>0x700</addressOffset>
               <register>
                  <name>ST2CW0</name>
                  <description>Screening Type 2 Compare Word 0 Register </description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>MASKVAL</name>
                        <description>Mask Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>COMPVAL</name>
                        <description>Compare Value</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ST2CW1</name>
                  <description>Screening Type 2 Compare Word 1 Register </description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>OFFSVAL</name>
                        <description>Offset Value in Bytes</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>OFFSSTRT</name>
                        <description>Ethernet Frame Offset Start</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>OFFSSTRTSelect</name>
                           <enumeratedValue>
                              <name>FRAMESTART</name>
                              <description>Offset from the start of the frame</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ETHERTYPE</name>
                              <description>Offset from the byte after the EtherType field</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>IP</name>
                              <description>Offset from the byte after the IP header field</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TCP_UDP</name>
                              <description>Offset from the byte after the TCP/UDP header field</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DISMASK</name>
                        <description>Disable Mask</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>DISMASKSelect</name>
                           <enumeratedValue>
                              <name>0</name>
                              <description>GMAC_ST2CW0R contains a 2-byte compare value with a 2-byte mask value.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>GMAC_ST2CW0R contains a 4-byte compare value.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
