Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D29.svd
            <register>
               <name>CC_RR_RG</name>
               <description>Color Correction RR RG Register</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RRGAIN</name>
                     <description>Red Gain for Red Component (signed 12 bits, 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>RGGAIN</name>
                     <description>Green Gain for Red Component (signed 12 bits, 1:3:8)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CC_RB_OR</name>
               <description>Color Correction RB OR Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RBGAIN</name>
                     <description>Blue Gain for Red Component (signed 12 bits, 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>ROFST</name>
                     <description>Red Component Offset (signed 13 bits, 1:12:0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CC_GR_GG</name>
               <description>Color Correction GR GG Register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GRGAIN</name>
                     <description>Red Gain for Green Component (signed 12 bits, 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>GGGAIN</name>
                     <description>Green Gain for Green Component (signed 12 bits, 1:3:8)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CC_GB_OG</name>
               <description>Color Correction GB OG Register</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GBGAIN</name>
                     <description>Blue Gain for Green Component (signed 12 bits, 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>ROFST</name>
                     <description>Green Component Offset (signed 13 bits, 1:12:0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CC_BR_BG</name>
               <description>Color Correction BR BG Register</description>
               <addressOffset>0x8C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BRGAIN</name>
                     <description>Red Gain for Blue Component (signed 12 bits, 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>BGGAIN</name>
                     <description>Green Gain for Blue Component (signed 12 bits, 1:3:8)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CC_BB_OB</name>
               <description>Color Correction BB OB Register</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BBGAIN</name>
                     <description>Blue Gain for Blue Component (signed 12 bits, 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>BOFST</name>
                     <description>Blue Component Offset (signed 13 bits, 1:12:0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GAM_CTRL</name>
               <description>Gamma Correction Control Register</description>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Gamma Correction Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BENABLE</name>
                     <description>Gamma Correction Enable for B Channel</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GENABLE</name>
                     <description>Gamma Correction Enable for G Channel</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RENABLE</name>
                     <description>Gamma Correction Enable for R Channel</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>64</dim>
               <dimIncrement>4</dimIncrement>
               <name>GAM_BENTRY[%s]</name>
               <description>Gamma Correction Blue Entry</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BSLOPE</name>
                     <description>Blue Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>BCONSTANT</name>
                     <description>Blue Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>64</dim>
               <dimIncrement>4</dimIncrement>
               <name>GAM_GENTRY[%s]</name>
               <description>Gamma Correction Green Entry</description>
               <addressOffset>0x198</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GSLOPE</name>
                     <description>Green Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>GCONSTANT</name>
                     <description>Green Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>64</dim>
               <dimIncrement>4</dimIncrement>
               <name>GAM_RENTRY[%s]</name>
               <description>Gamma Correction Red Entry</description>
               <addressOffset>0x298</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RSLOPE</name>
                     <description>Red Color Slope for Piecewise Interpolation (signed 10 bits 1:3:6)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RCONSTANT</name>
                     <description>Red Color Constant for Piecewise Interpolation (unsigned 10 bits 0:10:0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSC_CTRL</name>
               <description>Color Space Conversion Control Register</description>
               <addressOffset>0x398</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>RGB to YCbCr Color Space Conversion Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSC_YR_YG</name>
               <description>Color Space Conversion YR, YG Register</description>
               <addressOffset>0x39C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>YRGAIN</name>
                     <description>Reg Gain for Luminance (signed 12 bits 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>YGGAIN</name>
                     <description>Green Gain for Luminance (signed 12 bits 1:3:8)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSC_YB_OY</name>
               <description>Color Space Conversion YB, OY Register</description>
               <addressOffset>0x3A0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>YBGAIN</name>
                     <description>Blue Gain for Luminance Component (12 bits signed 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>YOFST</name>
                     <description>Luminance Offset (11 bits signed 1:10:0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSC_CBR_CBG</name>
               <description>Color Space Conversion CBR CBG Register</description>
               <addressOffset>0x3A4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CBRGAIN</name>
                     <description>Red Gain for Blue Chrominance (signed 12 bits, 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>CBGGAIN</name>
                     <description>Green Gain for Blue Chrominance (signed 12 bits 1:3:8)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSC_CBB_OCB</name>
               <description>Color Space Conversion CBB OCB Register</description>
               <addressOffset>0x3A8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CBBGAIN</name>
                     <description>Blue Gain for Blue Chrominance (signed 12 bits 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>CBOFST</name>
                     <description>Blue Chrominance Offset (signed 11 bits 1:10:0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSC_CRR_CRG</name>
               <description>Color Space Conversion CRR CRG Register</description>
               <addressOffset>0x3AC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CRRGAIN</name>
                     <description>Red Gain for Red Chrominance (signed 12 bits 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>CRGGAIN</name>
                     <description>Green Gain for Red Chrominance (signed 12 bits 1:3:8)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSC_CRB_OCR</name>
               <description>Color Space Conversion CRB OCR Register</description>
               <addressOffset>0x3B0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CRBGAIN</name>
                     <description>Blue Gain for Red Chrominance (signed 12 bits 1:3:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>CROFST</name>
                     <description>Red Chrominance Offset (signed 11 bits 1:10:0)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CBC_CTRL</name>
               <description>Contrast and Brightness Control Register</description>
               <addressOffset>0x3B4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Contrast and Brightness Control Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CBC_CFG</name>
               <description>Contrast and Brightness Configuration Register</description>
               <addressOffset>0x3B8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CCIR</name>
                     <description>CCIR656 Stream Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCIRMODE</name>
                     <description>CCIR656 Byte Ordering</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CCIRMODESelect</name>
                        <enumeratedValue>
                           <name>CBY</name>
                           <description>Byte ordering Cb0, Y0, Cr0, Y1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRY</name>
                           <description>Byte ordering Cr0, Y0, Cb0, Y1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YCB</name>
                           <description>Byte ordering Y0, Cb0, Y1, Cr0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YCR</name>
                           <description>Byte ordering Y0, Cr0, Y1, Cb0</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CBC_BRIGHT</name>
               <description>Contrast and Brightness, Brightness Register</description>
               <addressOffset>0x3BC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BRIGHT</name>
                     <description>Brightness Control (signed 11 bits 1:10:0)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CBC_CONTRAST</name>
               <description>Contrast and Brightness, Contrast Register</description>
               <addressOffset>0x3C0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CONTRAST</name>
                     <description>Contrast (unsigned 12 bits 0:4:8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUB422_CTRL</name>
               <description>Subsampling 4:4:4 to 4:2:2 Control Register</description>
               <addressOffset>0x3C4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>4:4:4 to 4:2:2 Chrominance Horizontal Subsampling Filter Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUB422_CFG</name>
               <description>Subsampling 4:4:4 to 4:2:2 Configuration Register</description>
               <addressOffset>0x3C8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CCIR</name>
                     <description>CCIR656 Input Stream</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCIRMODE</name>
                     <description>CCIR656 Byte Ordering</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CCIRMODESelect</name>
                        <enumeratedValue>
                           <name>CBY</name>
                           <description>Byte ordering Cb0, Y0, Cr0, Y1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRY</name>
                           <description>Byte ordering Cr0, Y0, Cb0, Y1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YCB</name>
                           <description>Byte ordering Y0, Cb0, Y1, Cr0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YCR</name>
                           <description>Byte ordering Y0, Cr0, Y1, Cb0</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FILTER</name>
                     <description>Low Pass Filter Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FILTERSelect</name>
                        <enumeratedValue>
                           <name>FILT0CO</name>
                           <description>Cosited, {1}</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FILT1CE</name>
                           <description>Centered {1, 1}</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FILT2CO</name>
                           <description>Cosited {1,2,1}</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FILT3CE</name>
                           <description>Centered {1, 3, 3, 1}</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUB420_CTRL</name>
               <description>Subsampling 4:2:2 to 4:2:0 Control Register</description>
               <addressOffset>0x3CC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>4:2:2 to 4:2:0 Vertical Subsampling Filter Enable (Center Aligned)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FILTER</name>
                     <description>Interlaced or Progressive Chrominance Filter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
