Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D29.svd
            <register>
               <name>CR</name>
               <description>Configuration Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NC</name>
                     <description>Number of Column Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NCSelect</name>
                        <enumeratedValue>
                           <name>DDR9_MDDR8_COL_BITS</name>
                           <description>9 bits to define the column number, up to 512 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 8 bits to define the column number, up to 256 columns, for LPDDR1-SDRAM</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR10_MDDR9_COL_BITS</name>
                           <description>10 bits to define the column number, up to 1024 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 9 bits to define the column number, up to 512 columns, for LPDDR1-SDRAM</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR11_MDDR10_COL_BITS</name>
                           <description>11 bits to define the column number, up to 2048 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 10 bits to define the column number, up to 1024 columns, for LPDDR1-SDRAM</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR12_MDDR11_COL_BITS</name>
                           <description>12 bits to define the column number, up to 4096 columns, for DDR2-SDRAM/DDR3-SDRAM/LPDDR2-SDRAM/LPDDR3-SDRAM 11 bits to define the column number, up to 2048 columns, for LPDDR1-SDRAM</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NR</name>
                     <description>Number of Row Bits</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NRSelect</name>
                        <enumeratedValue>
                           <name>_11_ROW_BITS</name>
                           <description>11 bits to define the row number, up to 2048 rows</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_12_ROW_BITS</name>
                           <description>12 bits to define the row number, up to 4096 rows</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_13_ROW_BITS</name>
                           <description>13 bits to define the row number, up to 8192 rows</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_14_ROW_BITS</name>
                           <description>14 bits to define the row number, up to 16384 rows</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAS</name>
                     <description>CAS Latency</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CASSelect</name>
                        <enumeratedValue>
                           <name>DDR_CAS2</name>
                           <description>LPDDR1 CAS Latency 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR_CAS3</name>
                           <description>LPDDR3/DDR2/LPDDR2/LPDDR1 CAS Latency 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR_CAS5</name>
                           <description>DDR3 CAS Latency 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR_CAS6</name>
                           <description>DDR3LPDDR3 CAS Latency 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DLL</name>
                     <description>Reset DLL</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DLLSelect</name>
                        <enumeratedValue>
                           <name>RESET_DISABLED</name>
                           <description>Disable DLL reset</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESET_ENABLED</name>
                           <description>Enable DLL reset</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIC_DS</name>
                     <description>Output Driver Impedance Control (Drive Strength)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIC_DSSelect</name>
                        <enumeratedValue>
                           <name>DDR2_NORMALSTRENGTH_DDR3_RZQ6</name>
                           <description>Normal drive strength (DDR2) - RZQ/6 (40 [NOM], DDR3)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR2_WEAKSTRENGTH_DDR3_RZQ7</name>
                           <description>Weak drive strength (DDR2) - RZQ/7 (34 [NOM], DDR3)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIS_DLL</name>
                     <description>DISABLE DLL</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ZQ</name>
                     <description>ZQ Calibration</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ZQSelect</name>
                        <enumeratedValue>
                           <name>INIT</name>
                           <description>Calibration command after initialization</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LONG</name>
                           <description>Long calibration</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHORT</name>
                           <description>Short calibration</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESET</name>
                           <description>ZQ Reset</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OCD</name>
                     <description>Off-chip Driver</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>OCDSelect</name>
                        <enumeratedValue>
                           <name>DDR2_EXITCALIB</name>
                           <description>Exit from OCD Calibration mode and maintain settings</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DDR2_DEFAULT_CALIB</name>
                           <description>OCD calibration default</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DQMS</name>
                     <description>Mask Data is Shared</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DQMSSelect</name>
                        <enumeratedValue>
                           <name>NOT_SHARED</name>
                           <description>DQM is not shared with another controller</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHARED</name>
                           <description>DQM is shared with another controller</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENRDM</name>
                     <description>Enable Read Measure</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENRDMSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>DQS/DDR_DATA phase error correction is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>DQS/DDR_DATA phase error correction is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LC_LPDDR1</name>
                     <description>Low-cost Low-power DDR1</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LC_LPDDR1Select</name>
                        <enumeratedValue>
                           <name>NOT_2_BANKS</name>
                           <description>Any type of memory devices except of low cost, low density Low Power DDR1.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BANKS_LPDDR1</name>
                           <description>Low-cost and low-density low-power DDR1. These devices have a density of 32 Mbits and are organized as two internal banks. To use this feature, the user has to define the type of memory and the data bus width (see Section 8.8 'MPDDRC Memory Device Register').The 16-bit memory device is organized as 2 banks, 9 columns and 11 rows.The 32-bit memory device is organized as 2 banks, 8 columns and 11 rows.It is impossible to use two 16-bit memory devices (2 x 32 Mbits) for creating one 32-bit memory device (64 Mbits). In this case, it is recommended to use one 32-bit memory device which embeds four internal banks.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NB</name>
                     <description>Number of Banks</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NBSelect</name>
                        <enumeratedValue>
                           <name>_4_BANKS</name>
                           <description>4-bank memory devices</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_BANKS</name>
                           <description>8 banks. Only possible when using the DDR2-SDRAM and low-power DDR2-SDRAM and DDR3-SDRAM and low-power DDR3-SDRAM devices.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NDQS</name>
                     <description>Not DQS</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NDQSSelect</name>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Not DQS is enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Not DQS is disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DECOD</name>
                     <description>Type of Decoding</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DECODSelect</name>
                        <enumeratedValue>
                           <name>SEQUENTIAL</name>
                           <description>Method for address mapping where banks alternate at each last DDR-SDRAM page of the current bank.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTERLEAVED</name>
                           <description>Method for address mapping where banks alternate at each DDR-SDRAM end of page of the current bank.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UNAL</name>
                     <description>Support Unaligned Access</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UNALSelect</name>
                        <enumeratedValue>
                           <name>UNSUPPORTED</name>
                           <description>Unaligned access is not supported.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUPPORTED</name>
                           <description>Unaligned access is supported.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPR0</name>
               <description>Timing Parameter 0 Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TRAS</name>
                     <description>Active to Precharge Delay</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRCD</name>
                     <description>Row to Column Delay</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TWR</name>
                     <description>Write Recovery Delay</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRC</name>
                     <description>Row Cycle Delay</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRP</name>
                     <description>Row Precharge Delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRRD</name>
                     <description>Active BankA to Active BankB</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TWTR</name>
                     <description>Internal Write to Read Delay</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TMRD</name>
                     <description>Load Mode Register Command to Activate or Refresh Command</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPR1</name>
               <description>Timing Parameter 1 Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TRFC</name>
                     <description>Row Cycle Delay</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>TXSNR</name>
                     <description>Exit Self-refresh Delay to Non-Read Command</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXSRD</name>
                     <description>Exit Self-refresh Delay to Read Command</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXP</name>
                     <description>Exit Powerdown Delay to First Command</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPR2</name>
               <description>Timing Parameter 2 Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXARD</name>
                     <description>Exit Active Power Down Delay to Read Command in Mode 'Fast Exit'</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXARDS</name>
                     <description>Exit Active Power Down Delay to Read Command in Mode 'Slow Exit'</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRPA</name>
                     <description>Row Precharge All Delay</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRTP</name>
                     <description>Read to Precharge</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TFAW</name>
                     <description>Four Active Windows</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
