Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D29.svd
            <register>
               <name>MCKR</name>
               <description>Master Clock Register</description>
               <addressOffset>0x0030</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSS</name>
                     <description>Master/Processor Clock Source Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CSSSelect</name>
                        <enumeratedValue>
                           <name>SLOW_CLK</name>
                           <description>Slow clock is selected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAIN_CLK</name>
                           <description>Main clock is selected</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLA_CLK</name>
                           <description>PLLACK is selected</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPLL_CLK</name>
                           <description>UPLL Clock is selected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRES</name>
                     <description>Master/Processor Clock Prescaler</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>PRESSelect</name>
                        <enumeratedValue>
                           <name>CLOCK</name>
                           <description>Selected clock</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLOCK_DIV2</name>
                           <description>Selected clock divided by 2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLOCK_DIV4</name>
                           <description>Selected clock divided by 4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLOCK_DIV8</name>
                           <description>Selected clock divided by 8</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLOCK_DIV16</name>
                           <description>Selected clock divided by 16</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLOCK_DIV32</name>
                           <description>Selected clock divided by 32</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLOCK_DIV64</name>
                           <description>Selected clock divided by 64</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MDIV</name>
                     <description>Master Clock Division</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>MDIVSelect</name>
                        <enumeratedValue>
                           <name>EQ_PCK</name>
                           <description>Master Clock is Prescaler Output Clock divided by 1.Warning: DDRCK is not available.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PCK_DIV2</name>
                           <description>Master Clock is Prescaler Output Clock divided by 2. DDRCK is equal to MCK.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PCK_DIV4</name>
                           <description>Master Clock is Prescaler Output Clock divided by 4. DDRCK is equal to MCK.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PCK_DIV3</name>
                           <description>Master Clock is Prescaler Output Clock divided by 3. DDRCK is equal to MCK.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PLLADIV2</name>
                     <description>PLLA Divisor by 2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>H32MXDIV</name>
                     <description>AHB 32-bit Matrix Divisor</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>H32MXDIVSelect</name>
                        <enumeratedValue>
                           <name>H32MXDIV1</name>
                           <description>The AHB 32-bit Matrix frequency is equal to the AHB 64-bit Matrix frequency. It is possible only if the AHB 64-bit Matrix frequency does not exceed 83 MHz.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>H32MXDIV2</name>
                           <description>The AHB 32-bit Matrix frequency is equal to the AHB 64-bit Matrix frequency divided by 2.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USB</name>
               <description>USB Clock Register</description>
               <addressOffset>0x0038</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>USBS</name>
                     <description>USB OHCI Input Clock Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBDIV</name>
                     <description>Divider for USB OHCI Clock</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>3</dim>
               <dimIncrement>4</dimIncrement>
               <name>PCK[%s]</name>
               <description>Programmable Clock 0 Register</description>
               <addressOffset>0x0040</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSS</name>
                     <description>Master Clock Source Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CSSSelect</name>
                        <enumeratedValue>
                           <name>SLOW_CLK</name>
                           <description>Slow clock is selected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAIN_CLK</name>
                           <description>Main clock is selected</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PLLA_CLK</name>
                           <description>PLLACK is selected</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPLL_CLK</name>
                           <description>UPLL Clock is selected</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCK_CLK</name>
                           <description>Master Clock is selected</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUDIO_CLK</name>
                           <description>Audio PLL clock is selected</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRES</name>
                     <description>Programmable Clock Prescaler</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x0060</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MOSCXTS</name>
                     <description>8 to 24 MHz Crystal Oscillator Status Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKA</name>
                     <description>PLLA Lock Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCKRDY</name>
                     <description>Master Clock Ready Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKU</name>
                     <description>UTMI PLL Lock Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY0</name>
                     <description>Programmable Clock Ready 0 Interrupt Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY1</name>
                     <description>Programmable Clock Ready 1 Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY2</name>
                     <description>Programmable Clock Ready 2 Interrupt Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCSELS</name>
                     <description>Main Clock Source Oscillator Selection Status Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCRCS</name>
                     <description>12 MHz RC Oscillator Status Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDEV</name>
                     <description>Clock Failure Detector Event Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x0064</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MOSCXTS</name>
                     <description>8 to 24 MHz Crystal Oscillator Status Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKA</name>
                     <description>PLLA Lock Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCKRDY</name>
                     <description>Master Clock Ready Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKU</name>
                     <description>UTMI PLL Lock Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY0</name>
                     <description>Programmable Clock Ready 0 Interrupt Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY1</name>
                     <description>Programmable Clock Ready 1 Interrupt Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY2</name>
                     <description>Programmable Clock Ready 2 Interrupt Disable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCSELS</name>
                     <description>Main Oscillator Clock Source Selection Status Interrupt Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCRCS</name>
                     <description>12 MHz RC Oscillator Status Interrupt Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDEV</name>
                     <description>Clock Failure Detector Event Interrupt Disable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>Status Register</description>
               <addressOffset>0x0068</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MOSCXTS</name>
                     <description>8 to 24 MHz Crystal Oscillator Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKA</name>
                     <description>PLLA Lock Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCKRDY</name>
                     <description>Master Clock Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKU</name>
                     <description>UPLL Clock Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCSELS</name>
                     <description>Slow Clock Oscillator Selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY0</name>
                     <description>Programmable Clock Ready Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY1</name>
                     <description>Programmable Clock Ready Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY2</name>
                     <description>Programmable Clock Ready Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCSELS</name>
                     <description>Main Oscillator Selection Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCRCS</name>
                     <description>12 MHz RC Oscillator Status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDEV</name>
                     <description>Clock Failure Detector Event</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDS</name>
                     <description>Clock Failure Detector Status</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FOS</name>
                     <description>Clock Failure Detector Fault Output Status</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>APLLCKRDY</name>
                     <description>Audio PLL Lock Status</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCKRDY</name>
                     <description>Generic Clock Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x006C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MOSCXTS</name>
                     <description>8 to 24 MHz Crystal Oscillator Status Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKA</name>
                     <description>PLLA Lock Interrupt Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCKRDY</name>
                     <description>Master Clock Ready Interrupt Mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY0</name>
                     <description>Programmable Clock Ready 0 Interrupt Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY1</name>
                     <description>Programmable Clock Ready 1 Interrupt Mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCKRDY2</name>
                     <description>Programmable Clock Ready 2 Interrupt Mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCSELS</name>
                     <description>Main Oscillator Clock Source Selection Status Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MOSCRCS</name>
                     <description>12 MHz RC Oscillator Status Interrupt Mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFDEV</name>
                     <description>Clock Failure Detector Event Interrupt Mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
